; domain
(define (domain driverlog)
  (:requirements :typing :fluents) 
  (:types           location locatable - object
		driver truck obj - locatable)

  (:predicates 
		(at ?obj - locatable ?loc - location)
		(in ?obj1 - obj ?obj - truck)
		(driving ?d - driver ?v - truck)
		(link ?x  - location ?y - location) 
		(path ?x  - location ?y - location)
		(empty ?v - truck)
)
  (:functions 	
		(time-to-drive ?l1 - location ?l2 - location)
		(fuel-used)
		(fuel-per-minute ?t - truck)
		(load ?t - truck)
  )


(:action LOAD-TRUCK
  :parameters
   (?obj - obj
    ?truck - truck
    ?loc - location)
  :precondition
   (and (at ?truck ?loc) (at ?obj ?loc))
  :effect
   (and (not (at ?obj ?loc)) (in ?obj ?truck) (increase (load ?truck) 1)
		(increase (fuel-per-minute ?truck) (+ (load ?truck) 1))))

(:action UNLOAD-TRUCK
  :parameters
   (?obj - obj
    ?truck - truck
    ?loc - location)
  :precondition
   (and (at ?truck ?loc) (in ?obj ?truck))
  :effect
   (and (not (in ?obj ?truck)) (at ?obj ?loc) (decrease (load ?truck) 1)
		(decrease (fuel-per-minute ?truck) (load ?truck))))


(:action BOARD-TRUCK
  :parameters
   (?driver - driver
    ?truck - truck
    ?loc - location)
  :precondition
   (and (at ?truck ?loc) (at ?driver ?loc) (empty ?truck))
  :effect
   (and (not (at ?driver ?loc)) (driving ?driver ?truck) (not (empty ?truck))))

(:action DISEMBARK-TRUCK
  :parameters
   (?driver - driver
    ?truck - truck
    ?loc - location)
  :precondition
   (and (at ?truck ?loc) (driving ?driver ?truck))
  :effect
   (and (not (driving ?driver ?truck)) (at ?driver ?loc) (empty ?truck)))

(:action DRIVE-TRUCK
  :parameters
   (?truck - truck
    ?loc-from - location
    ?loc-to - location
    ?driver - driver)
  :precondition
   (and (at ?truck ?loc-from)
   (driving ?driver ?truck) (link ?loc-from ?loc-to))
  :effect
   (and (not (at ?truck ?loc-from)) (at ?truck ?loc-to)
		(increase (fuel-used) (* (fuel-per-minute ?truck) (time-to-drive ?loc-from ?loc-to)))))

(:action WALK
  :parameters
   (?driver - driver
    ?loc-from - location
    ?loc-to - location)
  :precondition
   (and (at ?driver ?loc-from) (path ?loc-from ?loc-to))
  :effect
   (and (not (at ?driver ?loc-from)) (at ?driver ?loc-to)))

 
)

; problem
(define (problem DLOG-4-3-4)
	(:domain driverlog)
	(:objects
	driver1 - driver
	driver2 - driver
	driver3 - driver
	driver4 - driver
	truck1 - truck
	truck2 - truck
	truck3 - truck
	package1 - obj
	package2 - obj
	package3 - obj
	package4 - obj
	s0 - location
	s1 - location
	s2 - location
	s3 - location
	s4 - location
	p1-2 - location
	p2-1 - location
	p2-4 - location
	p3-0 - location
	p3-1 - location
	p4-1 - location
	p4-3 - location
	)
	(:init
	(at driver1 s0)
	(at driver2 s1)
	(at driver3 s0)
	(at driver4 s0)
	(at truck1 s3)
	(empty truck1)
	(= (load truck1) 0)
	(= (fuel-per-minute truck1) 10)
	(at truck2 s4)
	(empty truck2)
	(= (load truck2) 0)
	(= (fuel-per-minute truck2) 10)
	(at truck3 s1)
	(empty truck3)
	(= (load truck3) 0)
	(= (fuel-per-minute truck3) 10)
	(at package1 s4)
	(at package2 s2)
	(at package3 s0)
	(at package4 s0)
	(path s1 p1-2)
	(path p1-2 s1)
	(path s2 p1-2)
	(path p1-2 s2)
	(path s2 p2-4)
	(path p2-4 s2)
	(path s4 p2-4)
	(path p2-4 s4)
	(path s3 p3-0)
	(path p3-0 s3)
	(path s0 p3-0)
	(path p3-0 s0)
	(path s3 p3-1)
	(path p3-1 s3)
	(path s1 p3-1)
	(path p3-1 s1)
	(path s4 p4-1)
	(path p4-1 s4)
	(path s1 p4-1)
	(path p4-1 s1)
	(path s4 p4-3)
	(path p4-3 s4)
	(path s3 p4-3)
	(path p4-3 s3)
	(link s0 s1)
	(link s1 s0)
	(= (time-to-drive s0 s1) 98)
	(= (time-to-drive s1 s0) 98)
	(link s0 s2)
	(link s2 s0)
	(= (time-to-drive s0 s2) 18)
	(= (time-to-drive s2 s0) 18)
	(link s0 s3)
	(link s3 s0)
	(= (time-to-drive s0 s3) 82)
	(= (time-to-drive s3 s0) 82)
	(link s0 s4)
	(link s4 s0)
	(= (time-to-drive s0 s4) 50)
	(= (time-to-drive s4 s0) 50)
	(link s2 s3)
	(link s3 s2)
	(= (time-to-drive s2 s3) 49)
	(= (time-to-drive s3 s2) 49)
	(link s2 s4)
	(link s4 s2)
	(= (time-to-drive s2 s4) 33)
	(= (time-to-drive s4 s2) 33)
	(link s3 s4)
	(link s4 s3)
	(= (time-to-drive s3 s4) 72)
	(= (time-to-drive s4 s3) 72)
	(= (fuel-used) 0)
)
	(:goal (and
	(at driver1 s3)
	(at driver2 s4)
	(at driver3 s3)
	(at driver4 s4)
	(at truck2 s3)
	(at package2 s4)
	(at package3 s4)
	(at package4 s0)
	))

(:metric minimize (+ (* 2 (total-time)) (* 4 (fuel-used))))

)

; plan
1. (board-truck driver2 truck3 s1)
   deleted: (at driver2 s1) (empty truck3)
   added: (driving driver2 truck3)
   goals met: 1 of 8
2. (walk driver1 s0 p3-0)
   deleted: (at driver1 s0)
   added: (at driver1 p3-0)
   goals met: 1 of 8
3. (walk driver3 s0 p3-0)
   deleted: (at driver3 s0)
   added: (at driver3 p3-0)
   goals met: 1 of 8
4. (drive-truck truck3 s1 s0 driver2)
   deleted: (at truck3 s1)
   added: (at truck3 s0)
   changed: (fuel-used) from 0 to 980
   goals met: 1 of 8
5. (load-truck package3 truck3 s0)
   deleted: (at package3 s0)
   added: (in package3 truck3)
   changed: (load truck3) from 0 to 1, (fuel-per-minute truck3) from 10 to 11
   goals met: 1 of 8
6. (drive-truck truck3 s0 s4 driver2)
   deleted: (at truck3 s0)
   added: (at truck3 s4)
   changed: (fuel-used) from 980 to 1530
   goals met: 1 of 8
7. (walk driver1 p3-0 s3)
   deleted: (at driver1 p3-0)
   added: (at driver1 s3)
   goals met: 2 of 8
8. (walk driver3 p3-0 s3)
   deleted: (at driver3 p3-0)
   added: (at driver3 s3)
   goals met: 3 of 8
9. (unload-truck package3 truck3 s4)
   deleted: (in package3 truck3)
   added: (at package3 s4)
   changed: (load truck3) from 1 to 0, (fuel-per-minute truck3) from 11 to 10
   goals met: 4 of 8
10. (drive-truck truck3 s4 s2 driver2)
   deleted: (at truck3 s4)
   added: (at truck3 s2)
   changed: (fuel-used) from 1530 to 1860
   goals met: 4 of 8
11. (load-truck package2 truck3 s2)
   deleted: (at package2 s2)
   added: (in package2 truck3)
   changed: (load truck3) from 0 to 1, (fuel-per-minute truck3) from 10 to 11
   goals met: 4 of 8
12. (drive-truck truck3 s2 s4 driver2)
   deleted: (at truck3 s2)
   added: (at truck3 s4)
   changed: (fuel-used) from 1860 to 2223
   goals met: 4 of 8
13. (disembark-truck driver2 truck3 s4)
   deleted: (driving driver2 truck3)
   added: (at driver2 s4) (empty truck3)
   goals met: 5 of 8
14. (board-truck driver2 truck2 s4)
   deleted: (at driver2 s4) (empty truck2)
   added: (driving driver2 truck2)
   goals met: 4 of 8
15. (unload-truck package2 truck3 s4)
   deleted: (in package2 truck3)
   added: (at package2 s4)
   changed: (load truck3) from 1 to 0, (fuel-per-minute truck3) from 11 to 10
   goals met: 5 of 8
16. (drive-truck truck2 s4 s0 driver2)
   deleted: (at truck2 s4)
   added: (at truck2 s0)
   changed: (fuel-used) from 2223 to 2723
   goals met: 5 of 8
17. (disembark-truck driver2 truck2 s0)
   deleted: (driving driver2 truck2)
   added: (at driver2 s0) (empty truck2)
   goals met: 5 of 8
18. (board-truck driver4 truck2 s0)
   deleted: (at driver4 s0) (empty truck2)
   added: (driving driver4 truck2)
   goals met: 5 of 8
19. (drive-truck truck2 s0 s3 driver4)
   deleted: (at truck2 s0)
   added: (at truck2 s3)
   changed: (fuel-used) from 2723 to 3543
   goals met: 6 of 8
20. (disembark-truck driver4 truck2 s3)
   deleted: (driving driver4 truck2)
   added: (at driver4 s3) (empty truck2)
   goals met: 6 of 8
21. (walk driver4 s3 p4-3)
   deleted: (at driver4 s3)
   added: (at driver4 p4-3)
   goals met: 6 of 8
22. (walk driver4 p4-3 s4)
   deleted: (at driver4 p4-3)
   added: (at driver4 s4)
   goals met: 7 of 8
23. (walk driver2 s0 p3-0)
   deleted: (at driver2 s0)
   added: (at driver2 p3-0)
   goals met: 7 of 8
24. (walk driver2 p3-0 s3)
   deleted: (at driver2 p3-0)
   added: (at driver2 s3)
   goals met: 7 of 8
25. (walk driver2 s3 p4-3)
   deleted: (at driver2 s3)
   added: (at driver2 p4-3)
   goals met: 7 of 8
26. (walk driver2 p4-3 s4)
   deleted: (at driver2 p4-3)
   added: (at driver2 s4)
   goals met: 8 of 8
